Tekla Open API Reference for Tekla Structures 2025
FilterExpression.IsEnable Property
 Gets or sets the enabled state of the filter expression.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsEnable { get; set; }
Public Property IsEnable As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FilterExpression Class
Tekla.Structures.Filtering Namespace